Repository: 84000/translation-memory-resources
Catalog: post_input/toh70.bo.en.tmx
Source language: bo
Languages: en

source: ལག་ བཟངས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་པ་ དང་ །_ |#| བྱང་ཆུབ་ ཀྱི་ སེམས་ རྗེས་སུ་ དྲན་པ་ དང་ །_ བྱང་ཆུབ་ ཀྱི་ སེམས་ སྒོམ་པ་ དང་ །_ |#| བྱང་ཆུབ་ ཏུ་ སྨོན་པ་ དང་ །_ བྱང་ཆུབ་ ཏུ་ སྨོན་ལམ་ འདེབས་པ་ གང་ཡིན་པ་ དེ་ཉིད་ དེ་དག་ གི་ བརྩོན་འགྲུས་ དགེ་བ་ དང་ །_ རྩོལ་བ་ དགེ་བ་ གྲངས་མེད་ ཅིང་ དཔག་ ཏུ་ མེད་པ་ ཡིན་ ནོ །_།
en: Subāhu, bodhisattvas’ formation of the resolve set on awakening, |#| their recollection and cultivation of the resolve for awakening, and |#| their wishes and aspirations for awakening are themselves the bodhisattvas’ immeasurable and incalculable virtues of diligence and exertion.

source: འདི་ལྟ་སྟེ །_ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ དུ་ སེམས་ཅན་ ཐམས་ཅད་ ལ་ ཟག་པ་ མེད་པ འི་ བརྩོན་འགྲུས་ བསྐྱེད་པ ར་ འདོད་པ་ དང་ །_ ཟག་པ་ མེད་པ འི་ བརྩོན་ [167b] འགྲུས་ ཡང་དག་ པར་ བསྐྱེད་པ ར་ འདོད་པ་ དང་ །_ མི་སློབ་པ འི་ བརྩོན་འགྲུས་ བསྐྱེད་པ ར་ འདོད་པ་ དང་ །_ མི་སློབ་པ འི་ བརྩོན་འགྲུས་ ཡང་དག་ པར་ བསྐྱེད་པ ར་ འདོད་པ་ དེ་ ནི་ བརྩོན་འགྲུས་ དགེ་བ་ དང་ །_ རྩོལ་བ་ དགེ་བ་ ཐམས་ཅད་ ཀྱི་ མཆོག་ ཡིན་ ནོ །_། དེ་ ནི་ དམ་པ་ ཡིན་ ནོ །_།
en: It is because among all the virtues of diligence and exertion, foremost and supreme is the wish to engender undefiled diligence and diligence at the level of no-more training, [167.b] and to do so perfectly, in all beings throughout all world systems.

source: ལག་ བཟངས་ དེ་ལྟ ར་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ བདེ་བ་ དང་ ལྡན་ ལ་ ཡིད་ བདེ་བ་ དང་ ལྡན་ ཞིང་ ཚེགས་ ཆུང་ངུ་ དང་ །_ སྡུག་བསྔལ་ ཆུང་ངུ ས་ མྱུར་ དུ་ སྐྱེན་པ ར་ བརྩོན་འགྲུས་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱེད་ དོ །།_།།
en: Subāhu, in this way bodhisattvas very quickly complete the perfection of diligence with ease and pleasure, little difficulty, and little pain.”

source: ལག་ བཟངས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཇི་ལྟ ར་ བསམ་གཏན་ གྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱེད་ ཅེ་ན །_
en: $63 “Subāhu, how do bodhisattvas complete the perfection of concentration?

source: ལག་ བཟངས་ འདི་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ མིག་ གིས་ གཟུགས་ རྣམས་ མཐོང་ ན །_ མཚན་མ ར་ མི་ འཛིན་ ཅིང་ མངོན་རྟགས་ སུ་ མི་ འཛིན་པ་ ཡིན་ ཏེ །_
en: Subāhu, when bodhisattvas see sights with their eyes they do not cling to their characteristics and features.

source: གང་ གི་ ཕྱིར་ མིག་ གི་ དབང་པོ་ སྡོམ་པ ས་ མ་ བསྡམས་པ ར་ གནས་པ ས་ འཇིག་རྟེན་ ན་ བརྣབ་སེམས་ དང་ །_ ཡིད་ མི་ བདེ་བ་ དང་ །_ སྡིག་པ་ མི་དགེ་བ འི་ ཆོས་ རྣམས་ ལ་ སེམས་ རྗེས་སུ་ ཟག་པ་ དེ་དག་ བསྡམ་པ འི་ ཕྱིར་ ནན་ཏན་ བྱེད་ ཅིང་ སྲུང་ སྟེ
en: They are attentive and vigilant about restraining the mind’s movements toward worldly covetousness, unhappiness, and factors connected with evil deeds and non-virtues that occur when the eye faculty is left uncontrolled by restraint.

source: མིག་ གི་ དབང་པོ ས་ མིག་ གི་ དབང་པོ་ སྡོམ་པ ར་ བྱེད་ དོ །_།
en: Thus, they control the eye faculty with the eye faculty.

source: དེ་བཞིན་ དུ་ རྣ་བ ས་ སྒྲ་ རྣམས་ ཐོས་པ་ དང་ །_
en: Similarly, when their ears hear sounds,

source: སྣ ས་ དྲི་ རྣམས་ ཚོར་བ་ དང་ །_
en: their noses perceive smells,

source: ལྕེ ས་ རོ་ རྣམས་ མྱོང་བ་ དང་ །_
en: their tongues experience tastes,

source: ལུས་ ཀྱིས་ རེག་བྱ་ རྣམས་ ལ་ རེག་པ་ དང་ །_
en: their bodies feel contact, and

source: ཡིད་ ཀྱིས་ ཆོས་ རྣམས་ རྣམ་པར་ ཤེས་ ནས་ མཚན་མ ར་ མི་ འཛིན་ ཅིང་ མངོན་རྟགས་ སུ་ མི་ འཛིན་པ་ ཡིན་ ཏེ
en: their minds cognize phenomena, they do not cling to characteristics and features.

source: གང་ གི་ ཕྱིར་ ཡིད་ ཀྱི་ དབང་པོ་ སྡོམ་པ ས་ མ་ བསྡམས་པ ར་ གནས་པ ས་ འཇིག་རྟེན་ ན་ བརྣབ་སེམས་ དང་ །_ ཡིད་ མི་ བདེ་བ་ དང་ །_ སྡིག་པ་ མི་དགེ་བ འི་ ཆོས་ རྣམས་ ལ་ སེམས་ རྗེས་སུ་ ཟག་པ་ དེ་དག་ བསྡམ་པ འི་ ཕྱིར་ ནན་ཏན་ བྱེད་ ཅིང་ སྲུང་ སྟེ
en: They are attentive and vigilant about restraining the mind’s movements toward worldly covetousness, unhappiness, and factors connected with evil deeds and non-virtues that occur when the mental faculty is left uncontrolled by restraint.

source: ཡིད་ ཀྱི་ དབང་པོ ས་ ཡིད་ ཀྱི་ དབང་པོ་ སྡོམ་པ ར་ བྱེད་ དོ །_།
en: Thus, they control the mental faculty with the mental faculty.

source: དེ་ འགྲོ་ འམ །_ འགྲེང་ ངམ །_ འདུག་ གམ །_ ཉལ་ ལམ །_ ཅང་ མི་སྨྲ་ བར་ གྱུར་ ཀྱང་ རུང་ སྟེ །_ མཉམ་པ ར་ གཞག་པ འི་ གནས་ དང་ །_ ཞི་བ འི་ གནས་ ཀྱི་ གནས་ མི་ འདོར་ རོ །_། རྣམ་པར་ མི་ འདོར་ རོ །_།
en: $64 “Whether they are walking, standing, sitting, lying, or silent, bodhisattvas neither dispense with nor forsake the states of meditative equipoise and calm abiding.

source: དེ་ ལག་ མི་རྒོད་པ་ དང་ །_ མུ་ཅོར་ མི་སྨྲ་བ་ དང་ །_ ཚིག་ མི་ མང་བ་ དང་ །_ མིག་ མི་ གཡེང་བ་ དང་ །_ དབང་པོ་ མི་ གཡེང་བ་ དང་ །_ མི་རྒོད་པ་ དང་ །_ ཏོམ་ ཅོལ་ མེད་པ་ དང་ །_ ལུས་ འཁྲུལ་པ་ མེད་པ་ དང་ །_ ངག་ འཁྲུལ་བ་ མེད་པ་ དང་ །_ སེམས་ [168a] འཁྲུལ་པ་ མེད་པ་ དང་ །_ དབེན་ ཡང་ རུང་ །_ མི་ དབེན་ ཡང་ རུང་ །_ སྤྱོད་ལམ་ མི་ ཉམས་པ་ ཡིན་ ནོ །_།
en: Whether they are in solitude or not, their behavior is uncorrupted: their hands are not restless, they do not talk nonsense, they do not speak too much, their eyes and other sense faculties are neither distracted nor agitated, they do not indulge in idle talk, and they are constant physically, verbally, and mentally. [168.a]

source: བཟའ་བ་ དང་ །_ བཏུང་བ་ དང་ །_ མལ་ཆ་ དང་ །_ སྟན་ དང་ །_ གནས་ དང་ །_ ན་བ འི་ གསོས་ སྨན་ དང་ །_ ཡོ་བྱད་ ཇི་ལྟ་བུ་ ཡང་ རུང་ བདག་ གིས་ ཆོག་ཤེས་ ཤིང་ གསོ་ སླ་བ་ དང་ །_ དགང་ སླ་བ་ དང་ །_ རིམ་གྲོ་ བྱ་ སླ་བ་ དང་ །_ ཆོ་ག་ དང་ སྤྱོད་ཡུལ་ དགེ་བ་ དང་ །_ འདུ་འཛི་ ལས་ དབེན་པ འི་ སྤྱོད་ཡུལ་ ཡིན །_
en: They are content with their amenities of food, drink, bedding, mats, dwelling places, and medicines to cure sicknesses, no matter what they are; they are easily sustained, easily satisfied, and easily served; their conduct and personal associations are virtuous, and in their personal associations they are withdrawn from society.#28

source: ཐོབ་པ་ དང་ མ་ ཐོབ་པ་ ལ་ མཉམ་ ཞིང་ འགྱུར་བ་ མེད་ དེ་ མ་ ཁེངས་ མ་ དུད་པ་ ཡིན །_
en: $65 “Bodhisattvas remain neutral and unchanged with regard to obtaining or not obtaining things; they are neither proud nor humble.

source: བདེ་བ་ དང་ །_ སྡུག་བསྔལ་བ་ དང་ །_ བསྟོད་པ་ དང་ །_ སྨད་པ་ དང་ །_ གྲགས་པ་ དང་ །_ མ་ གྲགས་པ་ དང་ །_ འཚོ་བ་ དང་ །_ འཆི་བ་ ལ་ མཉམ་ ཞིང་ འགྱུར་བ་ མེད་ དེ་
en: They remain neutral and unchanged with regard to happiness and suffering, praise and blame, fame and anonymity, and life and death;

source: མ་ ཁེངས་ མ་ དུད་པ་ ཡིན །_
en: they are neither proud nor humble.

source: མཛའ་བ་ དང་ །_ དགྲ་ དང་ །_ དགེ་བ་ དང་ །_ མི་དགེ་བ་ དང་ །_ ཡིད་ དུ་ འོང་བ་ དང་ འཐུན་པ་ དང་ །_ ཡིད་ དུ་ མི་ འོང་བ་ དང་ མི་ འཐུན་པ་ དང་ །_ འཕགས་པ་ དང་ །_ འཕགས་པ་ མ་ཡིན་པ འི་ ཆོས་ རྣམས་ དང་ །_ དབེན་པ་ དང་ །_ ལང་ལོང་ རྣམས་ ལ་ ཡང་ མཉམ་ ཞིང་ འགྱུར་བ་ མེད་ དེ་
en: They remain neutral and unchanged with regard to loved ones and enemies, fortune and misfortune, pleasant agreeable things and unpleasant disagreeable things, noble and ignoble things, and solitude and crowds;

source: གཟུགས་ སྡུག་པ་ དང་ །_ མི་ སྡུག་པ་ རྣམས་ ལ་ ཡང་ འཐུན་པ་ དང་ མི་ འཐུན་པ་ མེད་པ་ ཡིན །_
en: Likewise, attractive and unattractive sights are neither agreeable nor disagreeable to bodhisattvas.

source: སྒྲ་ དང་ །_ དྲི་ དང་ །_ རོ་ དང་ །_ རེག་བྱ་ དང་ །_ ཆོས་ སྡུག་པ་ དང་ །_ མི་ སྡུག་པ་ རྣམས་ ལ་ ཡང་ འཐུན་པ་ དང་ །_ མི་ འཐུན་པ་ མེད་པ་ ཡིན་ ནོ །_།
en: Attractive and unattractive sounds, smells, tastes, tangibles, and mental phenomena are also neither agreeable nor disagreeable to them.

source: དེ འི་ འདོད་པ་ རྣམས་ ནི་ རང་ གི་ སེམས་ ཀྱིས་ ཀུན་ ཏུ་ བསླང་ ནས་ ལོག་པ ར་ རྣམ་པར་ རྟོག་པ ས་ རོ་ མྱོང་བ་ ཡིན་པ ས་ ཀེང་རུས་ ལྟ་བུ ར་ ཡིད་ ལ་ བྱེད་ དོ །_།
en: Since objects of desire are experienced based on misconception, driven by their own mind, bodhisattvas#29 think of them as skeletons.

source: འདོད་པ་ རྣམས་ ནི་ དགྲ་ མང་བ འི་ ཕྱིར་ ཤ་སྣག་ གུ་ ལྟ་བུ ར་ ཡིད་ ལ་ བྱེད་ དོ །_།
en: Since objects of desire are a host of enemies, they think of them as lumps of flesh.#30

source: འདོད་པ་ རྣམས་ ནི་ བླངས་ ན་ སྡུག་བསྔལ་ ལ་ ཡོངས་སུ་ བཏང་ ན་ བདེ་བ འི་ ཕྱིར་ རྩྭ་མེ་ ལྟ་བུ ར་ ཡིད་ ལ་ བྱེད་ དོ །_།
en: Since one suffers when indulging in desires, but is happy when forsaking them, they think of them as a brush fire.#31

source: འདོད་པ་ རྣམས་ ནི་ གནོད་པ་ མང་བ འི་ ཕྱིར་ ཤིང་ གི་ རྩེ་མོ འི་ ཤིང་ཏོག་ ལྟ་བུ ར་ ཡིད་ ལ་ བྱེད་ དོ །_།
en: Since desires cause much harm, they think of them as fruits on the tips of trees.

source: འདོད་པ་ རྣམས་ ནི་ དབང་ བྱེད་པ་ མ་ཡིན་པ འི་ ཕྱིར་ སློང་བ་ ལྟ་བུ ར་ ཡིད་ ལ་ བྱེད་ དོ །_།
en: Since desires are not under control, they think of them as beggars.

source: འདོད་པ་ རྣམས་ ནི་ སྐད་ཅིག་ ཙམ་ ཞིག་ ནོར་ པས་ དགའ་བ འི་ ཕྱིར་ རྨི་ལམ་ ལྟ་བུ ར་ ཡིད་ ལ་ བྱེད་ དོ །_།
en: Since one takes pleasure in desires due to momentary confusion, they think of them as dreams.

source: འདོད་པ་ རྣམས་ ནི་ སྡུག་བསྔལ་ ལ་ བདེ་བ ར་ འདུ་ཤེས་པ་ ཕྱིན་ ཅི་ ལོག་ གིས་ བསྐྱེད་པ འི་ ཕྱིར་ མཛེ་ ལྟ་བུ ར་ ཡིད་ ལ་ བྱེད་ དོ །_།
en: Since desires are produced by the distorted perception of suffering as happiness, they think of them as leprosy.

source: འདོད་པ་ རྣམས་ ནི་ ཉེས་པ ར་ སྤྱོད་པ་ ཐམས་ཅད་ ཀྱི་ དངོས་པོ་ ཡིན་པ་ དང་ །_ ངན་འགྲོ་ ལོག་ [168b] པར་ ལྟུང་བ་ དང་ །_ སེམས་ཅན་ དམྱལ་བ འི་ མཐའ་ ཡིན་པ ས་ མཆིལ་པ་ ལྟ་བུ ར་ ཡིད་ ལ་ བྱེད་ དོ །_།
en: Since desires are the object of all evil behavior, [168.b], and cause one to fall into negative destinies and reach the brink of hell, they think of them as metal hooks.

source: འདོད་པ་ རྣམས་ ནི་ ངོམས་པ ར་ མི་ བྱེད་པ་ དང་ །_ སྐོམ་པ་ འཕེལ་བ ར་ བྱེད་པ འི་ ཕྱིར་ ཚྭ་ ཆུ་ ལྟ་བུ ར་ ཡིད་ ལ་ བྱེད་ དོ །_།
en: Since desires do not satiate but only increase one’s thirst, they think of them as salt water.

source: དེ་ འདོད་པ་ དག་ ལས་ དབེན་པ་ དང་ །_ སྡིག་པ་ མི་དགེ་བ འི་ ཆོས་ རྣམས་ ལས་ དབེན་པ་ རྟོག་པ་ དང་ བཅས་པ་ དཔྱོད་པ་ དང་ བཅས་པ །_ དབེན་པ་ ལས་ སྐྱེས་པ འི་ དགའ་བ་ དང་ བདེ་བ་ ཅན་ བསམ་གཏན་ དང་པོ་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: $66 “Bodhisattvas perfect and settle into the first concentration—a state secluded from desires, secluded from any factors connected with evil deeds and non-virtues, accompanied by reflection and analysis, and imbued with the joy and pleasure born of seclusion.

source: དེ་ རྟོག་པ་ དང་ །_ དཔྱོད་པ་ དང་ བྲལ་ ཞིང་ ནང་ ཡོངས་སུ་ དང་ སྟེ །_ |#| སེམས་ ཀྱི་ རྒྱུད་ གཅིག་ ཏུ་ གྱུར་པ ས་
en: $67 “When they have brought about the cessation of reflection and analysis, they become inwardly serene, and therefore their minds become concentrated.

source: རྟོག་པ་ མེད་པ །_ དཔྱོད་པ་ མེད་པ །_ ཏིང་ངེ་འཛིན་ ལས་ སྐྱེས་པ འི་ དགའ་བ་ དང་ །_ བདེ་བ་ ཅན་ བསམ་གཏན་ གཉིས་པ་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: Through this they perfect and settle into the second concentration, which is free of reflection and analysis and is imbued with the joy and pleasure born of meditative absorption.

source: དེ་ དགའ་བ འི་ འདོད་ཆགས་ དང་ བྲལ་བ ས་ བཏང་སྙོམས་ ལ་ གནས་ ཤིང་ དྲན་པ་ དང་ ཤེས་བཞིན་ ཅན་ ཡིན་ ཏེ །_ |#| བདེ་བ་ ལུས་ ཀྱིས་ མྱོང་ ལ་
en: $68 “Through disenchantment with joy, they remain impartial, maintain mindfulness and introspection, and |#| experience physical pleasure.

source: འཕགས་པ་ རྣམས་ ཀྱིས་ གང་དེ་ དྲན་པ་ དང་ ལྡན་པ་ བདེ་བ་ ལ་ གནས་པ་ བཏང་སྙོམས་པ འོ་ ཞེས་ བརྗོད་པ་ སྟེ །_
en: The noble ones call such people impartial ones dwelling on pleasure that is imbued with mindfulness.

source: བསམ་གཏན་ གསུམ་པ་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: They thus perfect and settle into the third concentration.

source: དེ་ བདེ་བ་ ཡང་ སྤངས་ ཏེ །_ སྔ་ ནས་ སྡུག་བསྔལ་ ཡང་ སྤངས་ ཤིང་ ཡིད་ བདེ་བ་ དང་ །_
en: $69 “Through also relinquishing pleasure, and having formerly relinquished pain in the past, both happiness and unhappiness vanish.

source: ཡིད་ མི་ བདེ་བ་ ཡང་ ནུབ་པ ས་ བདེ་བ་ ཡང་ མ་ ཡིན་ སྡུག་བསྔལ་བ་ ཡང་ མ་ཡིན་པ །_ |#| བཏང་སྙོམས་ དང་ དྲན་པ་ ཡོངས་སུ་ དག་པ་ བསམ་གཏན་ བཞི་པ་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: Thus they perfect and settle into the fourth concentration, which is pure impartiality and mindfulness, unconnected with pleasure or pain.#32

source: དེ་ སེམས་ཅན་ ཐམས་ཅད་ ལ་ བདེ་བ འི་ འདུ་ཤེས་ ཡིད་ ལ་ བྱེད་པ ས་ བྱམས་པ་ ཚད་ མེད་པ་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: $70 “By bringing to mind the perception of happiness for all beings, bodhisattvas perfect and settle into immeasurable love.

source: དེ་ སེམས་ཅན་ ཐམས་ཅད་ ལ་ སྡུག་བསྔལ་བ འི་ འདུ་ཤེས་ ཡིད་ ལ་ བྱེད་པ ས་ སྙིང་རྗེ་ ཚད་ མེད་པ་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: By bringing to mind the perception of the suffering of all beings, they perfect and settle into immeasurable compassion.

source: དེ་ སེམས་ཅན་ རྣམས་ ལ་ དགའ་བ འི་ འདུ་ཤེས་ ཡིད་ ལ་ བྱེད་པ ས་ དགའ་བ་ ཚད་ མེད་པ་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: By bringing to mind the perception of rejoicing for all beings, they perfect and settle into immeasurable joy.

source: དེ་ སེམས་ཅན་ རྣམས་ ལ་ སྡུག་བསྔལ་ ཡང་ མེད་ བདེ་བ་ ཡང་ མེད་པ་ ཡིད་ ལ་ བྱེད་པ ས་ བཏང་སྙོམས་ ཚད་ མེད་པ་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: By bringing to mind neither pain nor pleasure with respect to any being, they perfect and settle into immeasurable impartiality.

source: དེ་ གཟུགས་ ལ་ རགས་པ འི་ འདུ་ཤེས་ ཡིད་ ལ་ བྱེད་ ཅིང་ ནམ་མཁའ་ ལ་ ཞི་བ འི་ འདུ་ཤེས་ ཡིད་ ལ་ བྱེད་པ ས་ ནམ་མཁའ་ མཐའ་ ཡ ས་ སྐྱེ་མཆེད་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ [169a] སོ །_།
en: $71 “By bringing to mind the perception of form as coarse, and the perception of space as tranquil, bodhisattvas perfect and settle into the sphere of infinite space. [169.a]

source: དེ་ རྣམ་པར་ ཤེས་པ་ ལ་ ཞི་བ འི་ འདུ་ཤེས་ ཡིད་ ལ་ བྱེད་པ ས་ རྣམ་ཤེས་ མཐའ་ ཡ ས་ སྐྱེ་མཆེད་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: By bringing to mind the perception of consciousness as tranquil, they perfect and settle into the sphere of infinite consciousness.

source: དེ་ ཅི་ཡང་ མེད་པ་ ལ་ ཞི་བ འི་ འདུ་ཤེས་ ཡིད་ ལ་ བྱེད་པ ས་ ཅི་ཡང་ མེད་པ འི་ སྐྱེ་མཆེད་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: By bringing to mind the perception of absolute nothingness as tranquil, they perfect and settle into the sense sphere of absolute nothingness.

source: དེ་ འདུ་ཤེས་ མེད་ འདུ་ཤེས་ མེད་ མིན་ ལ་ ཞི་བ འི་ འདུ་ཤེས་ ཡིད་ ལ་ བྱེད་པ ས་ འདུ་ཤེས་ མེད་ འདུ་ཤེས་ མེད་ མིན་ སྐྱེ་མཆེད་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: By bringing to mind the perception of a state with neither perception nor non-perception as tranquil, they perfect and settle into the sphere of neither perception nor non-perception.

source: དེ་ རང་ གི་ དབུགས་ རྔུབ་པ་ དང་ འབྱུང་བ་ ཇི་ལྟ ར་ གནས་ ཤིང་ ཇི་ལྟ ར་ འདུག་པ་ བཞིན་ དུ་ རྒྱུན་ ཐུང་བ་ རྣམས་ ལ་ ཡང་ རྒྱུན་ ཐུང་བ འི་ འདུ་ཤེས་ དང་ །_ |#| རྒྱུན་ རིང་བ་ རྣམས་ ལ་ ཡང་ རྒྱུན་ རིང་བ འི་ འདུ་ཤེས་ ཡིད་ ལ་ བྱེད་པ ས་
en: $72 “By bringing to mind the perception of their inhalations and exhalations of shorter duration as having shorter duration and those of longer duration as having longer duration,

source: དབུགས་ རྔུབ་པ་ དང་ །_ འབྱུང་བ་ དྲན་པ་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: precisely in accordance with how long their inhalations and exhalations last and endure, they perfect and settle into the mindfulness of breathing.

source: དེ་ སེམས་ཅན་ གྱི་ ལུས་ རྣམས་ ལ་ མི་ སྡུག་པ འི་ མཚན་མ་ ཡིད་ ལ་ བྱེད་པ ས་ མི་ སྡུག་པ འི་ འདུ་ཤེས་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: By bringing to mind the marks of repulsiveness in the bodies of beings, they perfect and settle into the perception of repulsiveness.

source: དེ་ འཆི་བ འི་ མཚན་མ་ ཡིད་ ལ་ བྱེད་པ ས་ འཆི་བ འི་ འདུ་ཤེས་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: By bringing to mind the marks of death, they perfect and settle into the perception of death.

source: དེ་ ན་བ་ དང་ རྒ་བ འི་ མཚན་མ་ ཡིད་ ལ་ བྱེད་པ ས་ ཉེས་དམིགས་ ཀྱི་ འདུ་ཤེས་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: By bringing to mind the marks of sickness and aging, they perfect and settle into the perception of their defects.

source: དེ་ ཁ་ཟས་ ཡོངས་སུ་ ཚོལ་བ་ དང་ འགྱུར་བ་ ལ་ ནད་ ཀྱི་ རྒྱུ་ དང་ །_ གནོད་པ འི་ རྒྱུ ར་ ཡིད་ ལ་ བྱེད་པ ས་ ཁ་ཟས་ ལ་ མི་ འཐུན་པ འི་ འདུ་ཤེས་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: By bringing to mind that the search for food and its transience are causes for disease and harm, they perfect and settle into the perception of food as disagreeable.

source: དེ་ ཁྱིམ་ དང་ །_ གྲོང་ དང་ །_ གྲོང་ཁྱེར་ དང་ །_ ལྗོངས་ ཀྱི་ འཇིག་རྟེན་ ཐམས་ཅད་ ལ་ འབྱོར་པ་ དང་ བྲལ་བ འི་ མཚན་མ ར་ ཡིད་ ལ་ བྱེད་པ་ དང་ །_ ནགས་ཚལ་ རྨད་ དུ་ བྱུང་བ་ དང་ །_ ཀུན་དག འི་ ར་བ་ རྨད་ དུ་ བྱུང་བ་ དང་ བྲལ་བ འི་ མཚན་མ ར་ ཡིད་ ལ་ བྱེད་པ ས་ འཇིག་རྟེན་ ཐམས་ཅད་ ལ་ མངོན་པར་ མི་ དགའ་བ འི་ འདུ་ཤེས་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: By bringing to mind the marks of the entire world, with its households, villages, cities, and countries, as devoid of wealth and devoid of wondrous forests and delightful groves, they perfect and settle into the perception that the entire world is unpleasant.

source: དེ་ ནང་ གཟུགས་ སུ་ འདུ་ཤེས་ པས་ ཕྱི་རོལ་ གྱི་ གཟུགས་ ཆུང་ངུ་ ཁ་དོག་ བཟང་པོ་ དང་ཁ་ དོག་ ངན་པ་ རྣམས་ ལ་ མཚན་མ ར་ ཡིད་ ལ་ བྱེད་པ ས་ ཟིལ་ གྱིས་ གནོན་པ འི་ སྐྱེ་མཆེད་ དང་པོ་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: $73 “With a perception of internal physical matter, bodhisattvas bring to mind a small amount of external physical matter characterized by appealing and unappealing colors, and thereby perfect and settle into the first stage of mastery over the senses.

source: དེ་ ནང་ གཟུགས་ སུ་ འདུ་ཤེས་ པས་ ཕྱི་རོལ་ གྱི་ གཟུགས་ ཚད་ མེད་པ་ ཁ་དོག་ བཟང་པོ་ དང་ཁ་ དོག་ ངན་པ་ རྣམས་ ལ་ མཚན་མ ར་ ཡིད་ ལ་ བྱེད་པ ས་ ཟིལ་ གྱིས་ གནོན་པ འི་ སྐྱེ་མཆེད་ གཉིས་པ་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: With a perception of internal physical matter, they bring to mind an immeasurable amount of external physical matter characterized by appealing and unappealing colors, and thereby perfect and settle into the second stage of mastery over the senses.

source: དེ་ ཤི་བ འི་ ལུས་ བསྲེགས་པ་ དེ་ ལ་ རླུང་ ངམ་ ཆུས་ ཐལ་བ་ ཡང་ [169b] མེད་པར་ བྱེད་པ འི་ འདུ་ཤེས་ དང་ །_ ཞིགས་པ་ ལ་ ཕྱེ་མ་ ཡང་ མེད་པ་ དང་ །_ རྡུལ་ དུ་ གྱུར་པ་ ལ་ རྡུལ་ ཀྱང་ མེད་པ འི་ འདུ་ཤེས་ སུ་ རྣམ་པར་ འཇིག་པ་ བསྒོམས་ ཤིང་ བསྒྲུབས་ ཏེ་
en: They cultivate and accomplish disintegration as the perception that, due to wind or water, even the ash of a cremated corpse does not remain, [169.b] and as the perception that after something has broken and disintegrated even powder and dust do not remain.

source: ནང་ གཟུགས་ མེད་པར་ འདུ་ཤེས་ པས་ ཕྱི་རོལ་ གྱི་ གཟུགས་ ཆུང་ངུ་ ཁ་དོག་ བཟང་པོ་ དང་ཁ་ དོག་ ངན་པ་ རྣམས་ ལ་ མཚན་མ ར་ ཡིད་ ལ་ བྱེད་པ ས་ ཟིལ་ གྱིས་ གནོན་པ འི་ སྐྱེ་མཆེད་ གསུམ་པ་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: Thus, with a perception that there is no internal physical matter, bodhisattvas bring to mind a minute amount of external physical matter characterized by appealing and unappealing colors, and thereby perfect and settle into the third stage of mastery over the senses.

source: དེ་དེ་ བཞིན་ དུ་ ནང་ གཟུགས་ མེད་པར་ འདུ་ཤེས་ པས་ ཕྱི་རོལ་ གྱི་ གཟུགས་ ཚད་ མེད་པ་ ཁ་དོག་ བཟང་པོ་ དང་ །_ ཁ་དོག་ ངན་པ་ རྣམས་ ལ་ མཚན་མ ར་ ཡིད་ ལ་ བྱེད་པ ས་ ཟིལ་ གྱིས་ གནོན་པ འི་ སྐྱེ་མཆེད་ བཞི་པ་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: Similarly, with a perception that there is no internal physical matter, they bring to mind an immeasurable amount of external physical matter characterized by appealing and unappealing colors, and thereby perfect and settle into the fourth stage of mastery over the senses.

source: དེ་དེ་ བཞིན་ དུ་ ནང་ གཟུགས་ མེད་པར་ འདུ་ཤེས་ པས་ ཕྱི་རོལ་ གྱི་ གཟུགས་ སྔོན་པོ་ ཚད་ མེད་པ་ ཡིད་ དུ་ འོང་བ་ རྣམས་ ལ་ མཚན་མ ར་ ཡིད་ ལ་ བྱེད་པ ས་ ཟིལ་ གྱིས་ གནོན་པ འི་ སྐྱེ་མཆེད་ ལྔ་པ་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: Similarly, with a perception that there is no internal physical matter, they bring to mind an immeasurable amount of external physical matter characterized by an immeasurable and attractive blue color, and thereby perfect and settle into the fifth stage of mastery over the senses.

source: དེ་དེ་ བཞིན་ དུ་ ནང་ གཟུགས་ མེད་པར་ འདུ་ཤེས་ པས་ ཕྱི་རོལ་ གྱི་ གཟུགས་ སེར་པོ་ དང་ །_ དམར་པོ་ དང་ །_ དཀར་པོ་ ཚད་ མེད་པ་ ཡིད་ དུ་ འོང་བ་ རྣམས་ ལ་ མཚན་མ ར་ ཡིད་ ལ་ བྱེད་པ ས་ ཟིལ་ གྱིས་ གནོན་པ འི་ སྐྱེ་མཆེད་ དྲུག་པ་ དང་ །_ བདུན་པ་ དང་ །_ བརྒྱད་པ་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: Similarly, with a perception that there is no internal physical matter, they bring to mind an immeasurable amount of external physical matter characterized in turn by an immeasurable and attractive yellow, red, and white color, and thereby perfect and settle into the sixth, seventh, and eighth stages of mastery over the senses.

source: དེས་ ས་ འདི་ མཐའ་ ཡ ས་ སོ་ ཞེས་ མཚན་མ ར་ ཡིད་ ལ་ བྱེད་པ ས་ ཟད་པ ར་ ས ར་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: $74 “Saying, ‘The earth element is limitless,’ bodhisattvas bring its characteristics to mind and thereby perfect and settle into the totality of earth.

source: དེ་ ཆུ་ དང་ །_ མེ་ དང་ །_ རླུང་ དང་ །_ སྔོན་པོ་ དང་ །_ སེར་པོ་ དང་ །_ དམར་པོ་ དང་ །_ དཀར་པོ་ དང་ །_ ནམ་མཁའ་ དང་ །_ རྣམ་པར་ ཤེས་པ་ མཐའ་ ཡ ས་ སོ་ ཞེས་
en: Saying, ‘Water, fire, wind, blue, yellow, red, white, space, and consciousness are limitless,’

source: མཚན་མ ར་ ཡིད་ ལ་ བྱས་པ ས་ ཟད་པ ར་ ཆུ་ དང་ །_ |#| ཟད་པ ར་ མེ་ དང་ །_ ཟད་པ ར་ རླུང་ དང་ །_
en: they bring their characteristics to mind and thereby perfect and settle within the totality of water, the totality of fire, the totality of wind,

source: ཟད་པ ར་ སྔོན་པོ་ དང་ །_ ཟད་པ ར་ སེར་པོ་ དང་ །_ ཟད་པ ར་ དམར་པོ་ དང་ །_ ཟད་པ ར་ དཀར་པོ་ དང་ །_
en: the totality of blue, the totality of yellow, the totality of red, the totality of white,

source: ཟད་པ ར་ ནམ་མཁའ་ དང་ །_ ཟད་པ ར་ རྣམ་པར་ ཤེས་པ ར་ རྫོགས་པ ར་ བྱས་ ཏེ་ གནས་ སོ །_།
en: the totality of space, and the totality of consciousness.

source: དེ་ སྙོམས་པ ར་ འཇུག་པ་ ན་ དགེ་བ འི་ རྩ་བ་ ཐམས་ཅད་ ལ་ དམིགས་པ་ ལ་ སེམས་ ཉེ་བ ར་ འདོགས་ ཏེ །_
en: $75 “Upon settling into equilibrium, bodhisattvas apply their minds to focus on all roots of virtue.

source: སྙིང་རྗེ་ ཆེན་པོ་ ལ་ དམིགས་པ་ དང་ །_ |#| དམ་པ འི་ ཆོས་ ཡོངས་སུ་ གཟུང་བ་ ལ་ དམིགས་པ་ དང་ །_ |#| དཀོན་མཆོག་ གསུམ་ གྱི་ རིགས་ མི་འཆད་པ ར་ བྱ་བ་ ལ་ དམིགས་པ་ དང་ །_ |#| སངས་རྒྱས་ ཀྱི་ སྐུ་ དང་ རྒྱན་ [170a] ལ་ དམིགས་པ་ དང་ །_ |#| སངས་རྒྱས་ ཀྱི་ གསུང་ ཚངས་པ འི་ དབྱངས་ ལ་ དམིགས་པ་ དང་ །_ |#| སྔོན་ གྱི་ སྨོན་ལམ་ ལ་ དམིགས་པ་ དང་ །_ |#| སེམས་ཅན་ ཐམས་ཅད་ ཡོངས་སུ་ སྨིན་པ ར་ བྱ་བ་ ལ་ དམིགས་པ་ དང་ །_ |#| འཇིག་རྟེན་ རྣམ་པར་ སྦྱང་བ་ ལ་ དམིགས་པ་ དང་ །_ |#| བྱང་ཆུབ་ ཀྱི་ སྙིང་པོ འི་ བཀོད་པ་ ལ་ དམིགས་པ་ དང་ །_ |#| ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ ལ་ དམིགས་པ་ དང་ །_ |#| སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཉོན་མོངས་པ་ གཞོམ་པ་ ལ་ དམིགས་པ་ ལ་ སེམས་ ཉེ་བ ར་ འདོགས་ སོ །_།
en: They apply their minds to focus on great compassion, |#| on obtaining the sublime Dharma, |#| on ensuring that the lineage of the Three Jewels is not cut off, |#| on the body and ornaments of the Buddha, [170.a] |#| on the Brahmā-like voice of the Buddha’s speech, |#| on previous aspirations, |#| on ripening all beings, |#| on purifying all the worlds, |#| on the arrangement of the seat of awakening, |#| on turning the wheel of Dharma, and |#| on conquering the afflictions in all beings.

source: དེ་ བསམ་གཏན་ བྱེད་པ་ ན་ རྣམ་པར་ ཤེས་པ འི་ གནས་ བཞི་ དང་ བྲལ་བ ར་ བསམ་གཏན་ བྱེད་ དོ །_།
en: $76 “When practicing concentration, they practice it free from the four objects of consciousness.#33

source: ས འི་ ཁམས་ ལ་ མི་ གནས །_ |#| ཆུ འི་ ཁམས་ ལ་ མི་ གནས །_ |#| མེ འི་ ཁམས་ ལ་ མི་ གནས །_ |#| རླུང་ གི་ ཁམས་ ལ་ མི་ གནས །_ |#| ནམ་མཁ འི་ ཁམས་ ལ་ མི་ གནས །_ |#| རྣམ་པར་ ཤེས་པ འི་ ཁམས་ ལ་ མི་ གནས །_ |#| འཇིག་རྟེན་ འདི་ ལ་ མི་ གནས །_ འཇིག་རྟེན་ ཕ་རོལ་ ལ་ མི་ གནས་པ ར་ བསམ་གཏན་ བྱེད་ དོ །_།
en: They practice concentration without dwelling on the element of earth, |#| the element of water, |#| the element of fire, |#| the element of wind, |#| the element of space, |#| the element of consciousness, |#| this world, or future worlds.

source: དེ་ ཏིང་ངེ་འཛིན་ དང་ །_ སྙོམས་པ ར་ འཇུག་པ་ བླ་ ན་ མེད་པ་ ཐམས་ཅད་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ བསམ་གཏན་ ལ་ གནས་ ཤིང་ བསམ་གཏན་ ལ་ དག འོ །_།
en: In order to attain all unsurpassed states of absorption and equilibrium, they settle into concentration and delight in it.

source: དེ་ བསམ་གཏན་ དེ་ དང་ །_ ཏིང་ངེ་འཛིན་ དེ་ ལ་ བསམ་གཏན་ བྱེད་པ ར་ འདོད་པ་ དང་ །_ སྙོམས་པ ར་ འཇུག་པ ར་ འདོད་པ་ ན་ ཡང་
en: $77 “Should bodhisattvas even just wish to practice concentration and rest in equilibrium with respect to those concentrations and absorptions,

source: སེམས་ཅན་ ཐམས་ཅད་ བསྒྲལ་བ་ དང་ །_ |#| སེམས་ཅན་ ཐམས་ཅད་ དགྲོལ་བ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ དབུགས་དབྱུང་བ་ དང་ །_ ཐམས་ཅད་ མཁྱེན་པ་ ཉིད་ ཐོབ་པ ར་ བྱ་བ་ དང་ །_ སངས་རྒྱས་ ཀྱི་ ཆོས་ ཐམས་ཅད་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ་བ འི་ ཕྱིར་ ཡོངས་སུ་ སྔོ་བ ར་ བྱེད་ དོ །_།
en: they dedicate this so that all beings are ferried across, liberated, and relieved, and so that they may attain omniscience and perfect all the qualities of a buddha.
